import 'package:get/get_state_manager/src/simple/get_controllers.dart';

class BlogController extends GetxController {
  List<Map<String, dynamic>> Blog_Item = [
    {
      "title": "ফ্লাটার কি? এটি দিয়ে কি কি করা যায়?",
      "dis":
          "ফ্লাটার গুগলের নির্মিত একটি ওপেন-সোর্স ইউআই সফটওয়্যার ডেভলপমেন্ট কিট, যেটা ব্যবহার করে একক কোডভিত থেকে অ্যান্ড্রয়েড, আইওএস, উইন্ডোজ, ম্যাক, লিনাক্স, গুগল ফুসিয়া এবং ওয়েবের জন্য অ্যাপ্লিকেশন নির্মান করা সম্ভব। ফ্লাটারের প্রথম সংস্করণের কোডনাম ছিলো স্কাই যেটা শুধুমাত্র অ্যান্ড্রয়েডে চলতো। ২০১৫ সালের ডার্ট ডেভেলপার শীর্ষ সম্মেলনে ধারাবাহিকভাবে প্রতি সেকেন্ডে ১২০টি ফ্রেম রেন্ডারের সক্ষমতার বর্ণনা করে এটাকে উন্মোচিত করা হয়। [৫] শাংহাইয়ে গুগল ডেভেলপার দিবসের মূল বক্তব্যে গুগল ফ্লাটার রিলিজ প্রিভিউ ২-এর ঘোষণা দেয়, যেটা ৪ ডিসেম্বর ২০১৮ সালে মুক্তি পাওয়া ফ্লাটার ১.০-এর আগে ফ্লাটারের সবচেয়ে বড় মুক্তি, যেটা ফ্লাটার লাইভ ইভেন্টে প্রকাশিত হয়, এবং ফ্লাটারের প্রথম স্টেবল সংস্করণ। [৬] ২০১৯ সালের ১১ ডিসেম্বর ফ্লাটার ইন্টারেক্টিভ ইভেন্টে ফ্লাটার ১.১২ প্রকাশিত হয়।৬ মে ২০২০ সালে ডার্ট এসডিকে ২.৮ ও ফ্লাটার সংস্করণ ১.১৭.০ প্রকাশিত হয়। এ সংস্করণে অ্যাপলের মেটাল এপিআইর জন্য সমর্থন সংযুক্ত করা হয়, যেখানে আইওএস যন্ত্রসমূহে ফ্লাটারের পারফরমেন্স প্রায় ৫০% বৃদ্ধি পায়। এ সংস্করণে নতুন মেটারিয়েল উইজেট ও নতুন নেটওয়ার্ক ট্র্যাকিং টুলও যুক্ত করা হয়।৪ মার্চ ২০২১ তে গুগল একটা অনলাইন ফ্লাটার এংগেজমেন্ট ইভেন্টে ফ্লাটার ২ মুক্ত করে। এ বিশাল হালনাগাদটি ওয়েব-ভিত্তিক অ্যাপ্লিকেশনের জন্য প্রাতিষ্ঠানিক সমর্থন যুক্ত করে, সাথে সাথে উইন্ডোজ, ম্যাকওএস এবং লিনাক্সের জন্য ডেস্কটপ অ্যাপলিকেশন সমর্থন যুক্ত করে, যদিও এটা এখনও প্রারম্ভিক অবস্থায় আছে।",
      "image": "assets/blog_image/flutter.jpg",
    },
    {
      "title": "ডার্ট প্রোগ্রামিং ল্যাংগুয়েজ কি?",
      "dis":
          "ডার্ট হলো গুগলের তৈরি করা একটি প্রোগ্রামিং ভাষা যা ২০১১ সালের সবার জন্য উন্মুক্ত করা হয়। এটি ডিজাইন করেছেন Lars Bak. গুগল প্রথম থেকেই দাবি করে আসছে জাভাস্ক্রিপ্টের বিকল্প হিসেবে ব্যবহার করা যাবে ডার্ট। ডার্ট এর মাধ্যমে এবং ফ্লাটার ব্যবহার করে মোবাইল এপ্লিকেশন, ডেস্কটপ এপ্লিকেশন এবং ওয়েব এপ্লিকেশন বানাতে পারবেন। ফ্লাটার ডার্ট এর একটি ফ্রেমওয়ার্ক বলা যায়।গুগল কর্তৃপক্ষ জানিয়েছে, ডার্ট নামের প্রোগ্রামিং ভাষা ওয়েব অ্যাপ্লিকেশন প্রোগ্রামারদের কাজে লাগবে এবং জাভাস্ক্রিপ্টে যে ঘাটতি রয়েছে সেটি ডার্ট পূরণ করতে সক্ষম হবে। ডার্ট গুগলের হওয়ায় এর ভবিষ্যতে অনেক ব্যবহার দেখা যাবে।",
      "image": "assets/blog_image/dart.jpg",
    },
    {
      "title": "কৃত্রিম বুদ্ধিমত্তা কি? এটা কিভাবে কাজ করে?",
      "dis": "কৃত্রিম বুদ্ধিমত্তা হলো কম্পিউটার বিজ্ঞানের একটি শাখা, যেখানে মানুষের বুদ্ধিমত্তা ও চিন্তা শক্তিকে কম্পিউটার দ্বারা অনুকৃত করার চেষ্টা করা হয়ে থাকে। কৃত্রিম বুদ্ধিমত্তা এখন হয়ে উঠেছে একটি একাডেমিক শিক্ষার ক্ষেত্র যেখানে পড়ানো হয় কীভাবে বুদ্ধিমত্তা প্রদর্শন করবে এমন কম্পিউটার এবং সফটওয়্যার তৈরি করতে হয়। মানুষের বুদ্ধিমত্তা ও চিন্তা শক্তিকে কৃত্রিম উপায়ে প্রযুক্তি নির্ভর করে যন্ত্রের মাধ্যমে বাস্তবায়ন করাকে কৃত্রিম বুদ্ধিমত্তা বলে। [১] কম্পিউটারকে মিমিকস কগনেটিক এককে আনা হয় যাতে করে কম্পিউটার মানুষের মত ভাবতে পারে। যেমন শিক্ষা গ্রহণ এবং সমস্যার সমাধান[২]। কৃত্রিম বুদ্ধিমত্তা (এআই) হল মেশিন দ্বারা প্রদর্শিত বুদ্ধি। কম্পিউটার বিজ্ঞানের ক্ষেত্রে, এআই বুদ্ধিমান এজেন্ট -এর অধ্যয়ন হিসাবে নিজেকে সংজ্ঞায়িত করে: যে কোনও যন্ত্র যা তার পরিবেশকে অনুধাবন করতে পারে এবং এমন কিছু পদক্ষেপ নেয় যা লক্ষ্য অর্জনে তার সাফল্যকে অনেক দূর পর্যন্ত এগিয়ে নেয়। যখন একটি মেশিন জ্ঞানীয় ফাংশনগুলিকে কার্যকর করে যা অন্যান্য মানুষের মনের সাথে মিল থাকে, যেমন শিক্ষা গ্রহণ এবং সমস্যা সমাধানের সাথে সংযুক্ত, তখন কৃত্রিম বুদ্ধিমত্তা শব্দটি প্রয়োগ করা হয়। আন্দ্রেয়ার কাপলান এবং মাইকেল হেনলিন আর্টিফিশিয়াল ইন্টেলিজেন্স বা কৃত্রিম বুদ্ধিমত্তার সংজ্ঞায় বলেন এটি একটি সিস্টেমের বহির্ভূত তথ্য সঠিকভাবে ব্যাখ্যা করতে পারার ক্ষমতা, এমন তথ্য থেকে শিক্ষা গ্রহণ এবং ঐ শিক্ষা ব্যবহার করে নমনীয় অভিযোজনের মাধ্যমে বিশেষ লক্ষ্য করা। "
          "\n"
          "মেশিনগুলো ক্রমবর্ধমানভাবে সক্ষম হয়ে উঠে তখন মানুষের সুবিধার জন্য বুদ্ধিমত্তাকে সংজ্ঞা থেকে সরিয়ে ফেলার প্রয়োজন হয়। উদাহরণস্বরূপ, অপটিক্যাল অক্ষর স্বীকৃতিটি কৃত্রিম বুদ্ধিমত্তার উদাহরণ হিসাবে আর অনুভূত হয় না, তখন এটি একটি নিয়মিত প্রযুক্তি হয়ে ওঠে। বর্তমানে যে সক্ষমতাগুলোকে শ্রেণীবদ্ধ করা হয়েছে সেগুলি মানুষের বক্তব্যকে সফলভাবে বুঝতে পারে, কৌশলগত গেম সিস্টেম (যেমনঃ দাবা)[৪] উচ্চতর স্তরের প্রতিযোগিতায় অংশগ্রহণ করতে পারে, স্বয়ংক্রিয়ভাবে গাড়ি চালাতে পারে[৫], সামরিক সিমুলেশন[৬] এবং জটিল উপাত্ত গুলো ব্যাখ্যা করতে পারে।এআই গবেষণাকে কতগুলো উপশাখায় বিভক্ত করা যেতে পারে যা নির্দিষ্ট সমস্যা, দৃষ্টিভঙ্গি, বিশেষ সরঞ্জামের ব্যবহার বা নির্দিষ্ট অ্যাপ্লিকেশনগুলির সেরা পারফরমেন্সের দিকে নজর দেয়। মনে করি আমরা একটি প্রোগ্রাম লিখব, যে প্রোগ্রামটির কাজ হচ্ছে ইউজার থেকে ডাটা হিসেবে একটি ইমেজ ইনপুট নিবে এবং অউটপুট হিসেবে ওই ইমেজ টির মধ্যে কোনো কুকুর এর উপস্থিতি আছে কিনা তা Detect করবে।এই কাজটি করার পূর্বে অবশ্যই আমাদের প্রোগ্রামটিকে কুকুর কী সেইটা আগে চিনাতে হবে। তাই কুকুর এর বিভিন্ন রকম ইমেজ দিয়ে আগে আমাদের প্রোগ্রামটিকে ট্রেনিং করাতে হবে। যাতে করে আমাদের প্রোগ্রামটি কুকুর এর উপস্থিতি চিহ্নিত করতে পারে।যদি কোনো কারনে ইউজারের দেয়া ইনপুট থেকে প্রোগ্রামটি সঠিক আউটপুট দিতে ব্যার্থ হয় তাহলে প্রোগ্রামটি অবশ্যই ইউজারের সেই ইনপুটের জন্য নিজেকে আপডেট করে নিবে, যাকে আমরা বলছি নিজেকে ট্রেনআপ করে নিবে।এবং একটি প্রোগ্রাম যত বেশি নিজেকে ট্রেনআপ করবে তার এক্সপেরিয়েন্স তত বেশি হবে, এবং একটি প্রোগ্রামের যত বেশি এক্সপেরিয়েন্স বাড়বে এর সঠিক অউটপুট দেয়ার হার তত বাড়বে।",
      "image": "assets/blog_image/aiki.jpg",
    },
    {
      "title": "মেশিন লার্নিং কি? এটার কাজ কি?",
      "dis":
          "মেশিন লার্নিং (এমএল) হচ্ছে কোনও বারংবার বাহ্যিক নির্দেশ ব্যতীত বিন্যাসের উপর ভিত্তি করে নির্দিষ্ট একটি কর্ম সঠিকভাবে সম্পাদনের জন্যে কম্পিউটার ব্যবস্থার ব্যবহার করা অ্যালগরিদম ও পরিসংখ্যান মডেলের অধ্যয়ন। এটি কৃত্রিম বুদ্ধিমত্তা গবেষণা ক্ষেত্রের একটি উপক্ষেত্র। মেশিন লার্নিং এলগরিদম নমুনা উপাত্তের একটি গাণিতিক মডেল তৈরী করে, যার নাম দেয়া হয় অনুশীলন উপাত্তসমগ্র (ট্রেইনিং ডাটা)। এটি করা হয় ভবিষ্যতের কোন কর্ম পূর্বাপর তথ্যের উপর ভিত্তি করে সম্পাদনে সক্ষম হওয়ার জন্যে।মেশিন লার্নিংশব্দটা প্রথম ব্যবহার করেন আর্থার স্যামুয়েল ১৯৫৯ সালে। এর প‌রে টম মি‌শেল মে‌শিন লা‌র্নিংয়ের এক‌টি আধু‌নিক সংজ্ঞা দি‌য়ে‌ছেন। তি‌নি ব‌লে‌ছেন,এক‌টি ক‌ম্পিউটার প্রোগ্রাম কিছু কাজ , প্রাপ্ত অভিজ্ঞতা , কর্মদক্ষতার প‌রিমাপ  থে‌কে শি‌খে। ‌প্রোগ্রা‌মের পারফ‌র্মেন্স  টাস্ক  থে‌কে প্রাপ্ত অভিজ্ঞতা  ‌এর সা‌থে সাথে উন্ন‌তি ক‌রে।  তত্ত্বাবধানাধীন বা সুপারভাইজড মেশিন লার্নিঙের ক্ষেত্রে একটি উপাত্তসংগ্রহ (ডাটাসেট) দেওয়া থাকে এবং পূর্ব থেকেই নির্দিষ্ট করা থাকে সঠিক বহির্গত উপাত্ত (আউটপুট) কী হবে। এক্ষেত্রে অবশ্যই প্রবিষ্ঠ এবং বহির্গত উপাত্তের মধ্যে সম্পর্ক থাকে।",
      "image": "assets/blog_image/machine.jpg",
    },
    {
      "title": "আইটি বিষয়ে সবচেয়ে কোন সেক্টরে ভবিষ্যতে চাহিদা থাকবে?",
      "dis":
          "আইটি শাখার মুখ্য চাহিদা বৃদ্ধি করবে মেশিন লার্নিং, অ্যার্টিফিশিয়াল ইন্টেলিজেন্স, হাইব্রিড ক্লাউড, ডিজিটাল সেবা, ইওটিয়, বিগ ডেটা এবং সাইবার ​​নিরাপত্তা সেক্টরে। এই সেক্টরগুলি এখন থেকে ভবিষ্যতে খুব গুরুত্বপূর্ণ হবে কারণ সম্প্রসারণ, উন্নত দেশের ভবিষ্যতে ডিজিটাল পরিবর্তন ও সাইবার ​​নিরাপত্তা সর্বাধিক গুরুত্বপূর্ণ হবে।েশিন লার্নিং এবং অ্যার্টিফিশিয়াল ইন্টেলিজেন্স (AI) সেক্টরে বৃদ্ধি পাওয়া হবে কারণ এগুলি সাধারণভাবে প্রদত্ত বিগ ডেটা ব্যবহার করে সাহায্য করে প্রোসেসিং, নেটওয়ার্কিং এবং ডিজিটাল আউটপুট উন্নত করতে। হাইব্রিড ক্লাউড সেবা ব্যবহারকারীদের মধ্যে অভ্যন্তরীণ এবং পাবলিক সার্ভারের মধ্যে সমন্বয় সরবরাহ করবে, এটি ব্যবহারকারীদের জন্য একটি সুবিধাসম্পন্ন পরিবেশ সৃষ্টি করবে এবং উন্নত অনুভব উন্নত করবে।ডিজিটাল সেবার চাহিদা বাঢ়বে কারণ মানুষের জীবনে ডিজিটালাইজেশন হয়েছে, এবং অনলাইন সেবা প্রদানকারী সংস্থাগুলি চাহিদা অনুযায়ী উন্নয়ন করতে যাদের ডিজিটাল প্রদানে হয়।ইওটি প্রযুক্তির চাহিদা বাড়বে কারণ নেটওয়ার্ক ডিভাইস সংখ্যার বৃদ্ধি, আপাতত সম্প্রসারণ বা সংযোগের জন্য ডিজাইন করা ক্ষমতায় বহু ডিভাইসের মধ্যে তার ব্যবহার সম্পর্কিত সাধারণ মৌলিক অভিযন্ত্রণ তৈরী করতে।বিগ ডেটা সেক্টরে চাহিদা বৃদ্ধি পাবে কারণ বহু সময় অতিরিক্ত ডেটা, থকা হাস্টে প্রাসাদিত করা নেটওয়ার্কের মূল্যায়ন করা হয়। তাই, ডেটা ভিত্তিক সেবা সরবরাহকারীরা আপনাদের প্রদানকৃত সেবাগুলির মাধ্যমে ডেটা ভিত্তিক সাহায্য প্রদান করে।সাইবার ​​নিরাপত্তা সেক্টরে আরও বৃদ্ধি পাওয়া যাবে কারণ সাইবার ​​হ্যাকিং, ডেটা লুকানো এবং মালিকানাধীন ডেটা লুকিং এর মাধ্যমে জন্য এটি কোনও উদ্দেশ্যবিহীন কোম্পাউনেন্টের ধরনগুলি থাকতে পারে। উন্নত প্রযুক্তিতে বেশ কিছু ক্ষেত্রে অনুমান করা যায়।এই সেক্টরগুলি মানুষের জীবনের প্রতি দিক পরিবর্তন আনবে এবং ভবিষ্যতে সামগ্রিক উন্নতি করবে। সবার সাথে এই সেক্টর ও উন্নত করার ও নতুন প্রযুক্তি পরিচয় করার জন্য প্রয়োজন হতে পারে।",
      "image": "assets/blog_image/it.jpg",
    },
    {
      "title":
          "আর্টিফিশিয়াল ইন্টেলিজেন্স ৪০ শতাংশ চাকরিতে প্রভাব ফেলবে, পূর্বাভাস আইএমএফের",
      "dis":
          "ইন্টারন্যাশনাল মানিটারি ফান্ড বা আইএমএফের নতুন এক বিশ্লেষণ অনুযায়ী, আর্টিফিশিয়াল ইন্টেলিজেন্স (এআই) বা কৃত্রিম বুদ্ধিমত্তা সব ধরণের চাকরির প্রায় ৪০ শতাংশকে প্রভাবিত করবে।আইএমএফ-এর ব্যবস্থাপনা পরিচালক ক্রিস্টালিনা জর্জিয়েভা বলেছেন, “বেশির ভাগ পরিস্থিতিতে এআই সম্ভবত সামগ্রিকভাবে বৈষম্যকে আরো ভয়াবহ করবে। অন্য ভাবে বলা যায়, এআই-এর সে সব কাজ করার ক্ষমতা রয়েছে যা এখন মানুষ করছে। এটা শ্রমের চাহিদা কমাতে পারে, মজুরিতে প্রভাব এবং এমনকি চাকরি চলে যাওয়ার মতো ঘটনা ঘটাতে পারে।এদিকে, আইএমএফের প্রতিবেদনে বলা হয় যে, এই প্রযুক্তি স্বল্প আয়ের দেশে ২৬ শতাংশ চাকরিতে প্রভাব ফেলবে।এই প্রতিবেদন ২০২৩ সালে গোল্ডম্যান স্যাকসের একটা প্রতিবেদনের অনুরূপ।যাতে বলা হয়েছিলো, এআই তিনশ মিলিয়ন পূর্ণকালীন চাকরির সমান প্রতিস্থাপন করতে পারে। কিন্তু আরো বলা হয়েছে, উৎপাদনশীলতা বৃদ্ধির পাশাপাশি নতুন চাকরিও হতে পারে।এরই মধ্যে, নভেম্বরে ইউকের প্রধানমন্ত্রী ঋষি সুনাক বলেছেন, চাকরিতে এআই-এর প্রভাব নিয়ে উদ্বিগ্ন হওয়ার প্রয়োজন নেই। কারণ শিক্ষার যে সংস্কার হয়েছে তা দক্ষতার সংস্কারে আরো বেশি বৃদ্ধি করবে।মিস জর্জিয়েভা বলেছেন, “বেশির ভাগ দেশের এআই এর সুবিধা ব্যবহারের মতো অবকাঠামো বা দক্ষ জনশক্তি নেই। সময়ের সাথে সাথে জাতিগুলোর মধ্যে এই প্রযুক্তি বৈষম্যকে আরো প্রকট করে তুলবে।”আরো সাধারণভাবে বলা যায়, এআই প্রযুক্তি গ্রহণ করার পরে উচ্চ আয় এবং তরুণ কর্মীরা তাদের মজুরি অসমভাবে বৃদ্ধির বিষয়টি দেখতে পাবে।",
      "image": "assets/blog_image/aipic.jpg",
    },
    {
      "title": "সত্যিই কি সার্চ ইঞ্জিন আনছে ওপেনএআই",
      "dis":
          "গুগলের সঙ্গে প্রতিদ্বন্দ্বিতা করতে নতুন সার্চ ইঞ্জিন চালু করতে পারে প্রযুক্তি-দুনিয়ায় হইচই ফেলে দেওয়া ‘চ্যাটজিপিটি’র নির্মাতা প্রতিষ্ঠান ওপেনএআই। এ বিষয়ে প্রতিষ্ঠানটি আনুষ্ঠানিক কোনো ঘোষণা না দিলেও খুদে ব্লগ লেখার সাইট এক্সে (সাবেক টুইটার) দেওয়া এক পোস্টে প্রযুক্তি বিশ্লেষক জিমি অ্যাপল জানিয়েছেন, গুগলের আইও সম্মেলন হবে মে মাসের ১৪ তারিখে। এর আগেই একটি অনুষ্ঠান আয়োজনের মাধ্যমে নতুন সার্চ ইঞ্জিনের ঘোষণা দিতে পারে ওপেনএআই। দীর্ঘদিন ধরেই গুগলের আদলে ওয়েব সার্চ সুবিধা চালুর জন্য কাজ করছে ওপেনএআই। এমনকি ওপেনএআইয়ের প্রধান নির্বাহী কর্মকর্তা স্যাম অল্টম্যানও সার্চ ইঞ্জিনে লার্জ ল্যাঙ্গুয়েজ মডেল যুক্ত করার বিষয়ে তাঁর আগ্রহের কথা বিভিন্ন সময়ে জানিয়েছেন। আর তাই গুগলের সঙ্গে প্রতিদ্বন্দ্বিতা করতে ওপেনএআই নতুন সার্চ ইঞ্জিন চালু করতে পারে বলে ধারণা করা হচ্ছে।নিজের দাবির সপক্ষে যুক্তি তুলে ধরে জিমি অ্যাপল জানিয়েছেন, গত জানুয়ারি থেকেই মে মাসে অনুষ্ঠান আয়োজনের জন্য কাজ করছে ওপেনএআই। এমনকি গত মাসে ৫০টির বেশি সাবডোমেইন চালুর পাশাপাশি সফলভাবে অনুষ্ঠান আয়োজনের জন্য একজন ব্যবস্থাপককেও নিয়োগ দিয়েছে প্রতিষ্ঠানটি।",
      "image": "assets/blog_image/aisearch.png",
    },
    {
      "title": "গিট ও গিটহাব পরিচিতি ",
      "dis": "1.  গিটহাব কি জিনিস ? "
          "\n"
          "2. গিটহাব এর কি প্রয়জন ? "
          "\n"
          "\n3. গিট ও গিটহাব এর মধ্যে পার্থক্য কি ? "
          "\n"
          "'n"
          "১. সোজা বাংলায় বলতে গেলে গিটহাব হলো কোড রাখার গুগল ড্রাইভ। আমরা গুগল ড্রাইভে ছবি/ভিডিও ইত্যাদির আপলোড করে, তা আবার এক্সেস করতে পারি, চাইলে ডাউনলোড করতে পারি এবং মডিফাই করতে পারি সেই সাথে ড্রাইভ থেকে সরাসরি কারোর সাথে ছবি/ভিডিও শেয়ার করতে পারি। ঠিক একই ভাবে আমারা গিটহাবে কোড রাখতে পারি এবং পরে তা এক্সেস করতে পারি এবং অন্য ডেভেলপারদের সাথে শেয়ার করতে পারি। তলে তলে গিটহাব, গিট ব্যাবহার করে থাকে। তাই গিটহাবে কোড রাখলে সেটার version control নিয়ে আর কোনো মাথা ব্যাথা থাকেনা। সেই সাথে হোস্টিং, ইসু ট্র্যাকিং সহ আরো বেশ কিছু শুবিধা দিয়ে থাকে।"
          "\n"
          "\n"
          "২. গিটহাব কেনো প্রয়োজন তা জানার জন্য আমাদের বুঝতে হবে যে গিটহাব কোন সমস্যা সমাধান করছে। আমরা কয়েকদিন আগে গিট সম্পর্কে জেনেছিলাম যেটা মুলত একটা version control system. খুব জোস একটা জিনিস তবে এটা যার যার নিজের পিসিতে ইনস্টল দেওয়া লাগে। এখন একই প্রজেক্টে যদি একাধিক ডেভেলপার কাজ করতে চায় তাহলে সেখানে কিভাবে version control করা হবে ?? কারণ আমার পিসি এর সাথে তো নাহিয়ানের পিসির কোনো কানেকশন নেই। তাহলে গিট বুঝবে কিভেবা যে কোন কোডের হিসাব রাখা লাগবে ? এটা টার্মিনাল দিয়ে করা যায়না তা না, করা যায় তবে ঝামেলা। এই সমস্যা থেকে নিস্তার দিতে গিটহাব, গিট এর একটা ওয়েব ইন্টার্ফেস বানিয়েছে যেটা দিয়ে খুব সহযে একাধিক ডেভেলপার একই প্রজেক্টে contribute করতে পারে। সেই সাথে প্রজেক্ট ম্যানেজমেন্ট সহজ হয়ে যায়। কোডের সেফটি বাড়ে এবং সহজেই কোড হোস্ট করা যায়।"
          "\n"
          "\n"
          "৩. এ পর্যন্ত আলোচনায় এটা ক্লিয়ার যে গিট হলো version control system এবং গিটহাব হলো এর ওয়েব ইন্টার্ফেস, যেখানে সহজে collaboration করা যায়।মুলত গ্রুপ প্রোজক্ট করার জন্য এবং কোড সংরক্ষন করে রাখার কাজেই গিটহাব ব্যাবহার হয়ে থাকে। তবে এর আরো কিছু ব্যাবহার আছে। যেমন বই লিখে সংরক্ষন করা, ডকুমেন্টেশন লেখা, মিউজিক স্কোর সংরক্ষন করার মতো কাজেও গিটহাব ব্যাবহার করা হচ্ছে।শুধু যে গিটহাবই আছে এমন না, গিটহাবের মতো আরো বিভিন্ন ওয়েবসাইট আছে, যেমন Gitlab, Bitbucket, Rhodecode ইত্যাদি । তবে যেহেতু গিটহাব সবচেয়ে পপুলার এবং ইউসার বেশি। তাই সমনের লেখা গুলোতে গিটহাব নিয়ে কথা হবে। পরের লেখায় আলোচনা করা হবে গিটহাবের কিছু গুরত্বপূর্ণ কীওয়ার্ড নিয়ে।",
      "image": "assets/blog_image/images.jpeg",
    },
  ];
}
/*
*     {
      "title":
          "",
      "dis":"",
      "image":
          "",
    },
    * */
