import 'package:get/get_state_manager/src/simple/get_controllers.dart';

class BlogController extends GetxController {
  List<Map<String, dynamic>> Blog_Item = [
    {
      "title": "ফ্লাটার কি? এটি দিয়ে কি কি করা যায়?",
      "dis":
          "ফ্লাটার গুগলের তৈরী Mobile Application Development Framework । এটি সিংঙ্গেল কোড বেইসড তার মানে হচ্ছে আপনি একই কোডে Android ও iOS এর জন্য মোবাইল অ্যাপ্লিকেশন তৈরী করতে পারবেন। ফ্লাটার দিয়ে তৈরী মোবাইল অ্যাপগুলো Ionic, React Native, Xamarin এর মত Hybrid app নয় ফ্লাটার দিয়ে অ্যাপগুলো হয় সম্পূর্ণ Native অ্যাপ তাই এর পারফরমেন্স অসাধারণ।",
      "image": "assets/blog_image/flutter.jpg",
    },
    {
      "title": "ডার্ট প্রোগ্রামিং ল্যাংগুয়েজ কি?",
      "dis":
          "ডার্ট হলো গুগলের তৈরি করা একটি প্রোগ্রামিং ভাষা যা ২০১১ সালের সবার জন্য উন্মুক্ত করা হয়। এটি ডিজাইন করেছেন Lars Bak. গুগল প্রথম থেকেই দাবি করে আসছে জাভাস্ক্রিপ্টের বিকল্প হিসেবে ব্যবহার করা যাবে ডার্ট। ডার্ট এর মাধ্যমে এবং ফ্লাটার ব্যবহার করে মোবাইল এপ্লিকেশন, ডেস্কটপ এপ্লিকেশন এবং ওয়েব এপ্লিকেশন বানাতে পারবেন। ফ্লাটার ডার্ট এর একটি ফ্রেমওয়ার্ক বলা যায়।গুগল কর্তৃপক্ষ জানিয়েছে, ডার্ট নামের প্রোগ্রামিং ভাষা ওয়েব অ্যাপ্লিকেশন প্রোগ্রামারদের কাজে লাগবে এবং জাভাস্ক্রিপ্টে যে ঘাটতি রয়েছে সেটি ডার্ট পূরণ করতে সক্ষম হবে। ডার্ট গুগলের হওয়ায় এর ভবিষ্যতে অনেক ব্যবহার দেখা যাবে।",
      "image": "assets/blog_image/dart.jpg",
    },
    {
      "title": "কৃত্রিম বুদ্ধিমত্তা কি? এটা কিভাবে কাজ করে?",
      "dis": "কৃত্রিম বুদ্ধিমত্তা হলো কম্পিউটার বিজ্ঞানের একটি শাখা, যেখানে মানুষের বুদ্ধিমত্তা ও চিন্তা শক্তিকে কম্পিউটার দ্বারা অনুকৃত করার চেষ্টা করা হয়ে থাকে। কৃত্রিম বুদ্ধিমত্তা এখন হয়ে উঠেছে একটি একাডেমিক শিক্ষার ক্ষেত্র যেখানে পড়ানো হয় কীভাবে বুদ্ধিমত্তা প্রদর্শন করবে এমন কম্পিউটার এবং সফটওয়্যার তৈরি করতে হয়। মানুষের বুদ্ধিমত্তা ও চিন্তা শক্তিকে কৃত্রিম উপায়ে প্রযুক্তি নির্ভর করে যন্ত্রের মাধ্যমে বাস্তবায়ন করাকে কৃত্রিম বুদ্ধিমত্তা বলে। [১] কম্পিউটারকে মিমিকস কগনেটিক এককে আনা হয় যাতে করে কম্পিউটার মানুষের মত ভাবতে পারে। যেমন শিক্ষা গ্রহণ এবং সমস্যার সমাধান[২]। কৃত্রিম বুদ্ধিমত্তা (এআই) হল মেশিন দ্বারা প্রদর্শিত বুদ্ধি। কম্পিউটার বিজ্ঞানের ক্ষেত্রে, এআই বুদ্ধিমান এজেন্ট -এর অধ্যয়ন হিসাবে নিজেকে সংজ্ঞায়িত করে: যে কোনও যন্ত্র যা তার পরিবেশকে অনুধাবন করতে পারে এবং এমন কিছু পদক্ষেপ নেয় যা লক্ষ্য অর্জনে তার সাফল্যকে অনেক দূর পর্যন্ত এগিয়ে নেয়। যখন একটি মেশিন জ্ঞানীয় ফাংশনগুলিকে কার্যকর করে যা অন্যান্য মানুষের মনের সাথে মিল থাকে, যেমন শিক্ষা গ্রহণ এবং সমস্যা সমাধানের সাথে সংযুক্ত, তখন কৃত্রিম বুদ্ধিমত্তা শব্দটি প্রয়োগ করা হয়। আন্দ্রেয়ার কাপলান এবং মাইকেল হেনলিন আর্টিফিশিয়াল ইন্টেলিজেন্স বা কৃত্রিম বুদ্ধিমত্তার সংজ্ঞায় বলেন এটি একটি সিস্টেমের বহির্ভূত তথ্য সঠিকভাবে ব্যাখ্যা করতে পারার ক্ষমতা, এমন তথ্য থেকে শিক্ষা গ্রহণ এবং ঐ শিক্ষা ব্যবহার করে নমনীয় অভিযোজনের মাধ্যমে বিশেষ লক্ষ্য করা। "
          "\n"
          "মেশিনগুলো ক্রমবর্ধমানভাবে সক্ষম হয়ে উঠে তখন মানুষের সুবিধার জন্য বুদ্ধিমত্তাকে সংজ্ঞা থেকে সরিয়ে ফেলার প্রয়োজন হয়। উদাহরণস্বরূপ, অপটিক্যাল অক্ষর স্বীকৃতিটি কৃত্রিম বুদ্ধিমত্তার উদাহরণ হিসাবে আর অনুভূত হয় না, তখন এটি একটি নিয়মিত প্রযুক্তি হয়ে ওঠে। বর্তমানে যে সক্ষমতাগুলোকে শ্রেণীবদ্ধ করা হয়েছে সেগুলি মানুষের বক্তব্যকে সফলভাবে বুঝতে পারে, কৌশলগত গেম সিস্টেম (যেমনঃ দাবা)[৪] উচ্চতর স্তরের প্রতিযোগিতায় অংশগ্রহণ করতে পারে, স্বয়ংক্রিয়ভাবে গাড়ি চালাতে পারে[৫], সামরিক সিমুলেশন[৬] এবং জটিল উপাত্ত গুলো ব্যাখ্যা করতে পারে।এআই গবেষণাকে কতগুলো উপশাখায় বিভক্ত করা যেতে পারে যা নির্দিষ্ট সমস্যা, দৃষ্টিভঙ্গি, বিশেষ সরঞ্জামের ব্যবহার বা নির্দিষ্ট অ্যাপ্লিকেশনগুলির সেরা পারফরমেন্সের দিকে নজর দেয়। মনে করি আমরা একটি প্রোগ্রাম লিখব, যে প্রোগ্রামটির কাজ হচ্ছে ইউজার থেকে ডাটা হিসেবে একটি ইমেজ ইনপুট নিবে এবং অউটপুট হিসেবে ওই ইমেজ টির মধ্যে কোনো কুকুর এর উপস্থিতি আছে কিনা তা Detect করবে।এই কাজটি করার পূর্বে অবশ্যই আমাদের প্রোগ্রামটিকে কুকুর কী সেইটা আগে চিনাতে হবে। তাই কুকুর এর বিভিন্ন রকম ইমেজ দিয়ে আগে আমাদের প্রোগ্রামটিকে ট্রেনিং করাতে হবে। যাতে করে আমাদের প্রোগ্রামটি কুকুর এর উপস্থিতি চিহ্নিত করতে পারে।যদি কোনো কারনে ইউজারের দেয়া ইনপুট থেকে প্রোগ্রামটি সঠিক আউটপুট দিতে ব্যার্থ হয় তাহলে প্রোগ্রামটি অবশ্যই ইউজারের সেই ইনপুটের জন্য নিজেকে আপডেট করে নিবে, যাকে আমরা বলছি নিজেকে ট্রেনআপ করে নিবে।এবং একটি প্রোগ্রাম যত বেশি নিজেকে ট্রেনআপ করবে তার এক্সপেরিয়েন্স তত বেশি হবে, এবং একটি প্রোগ্রামের যত বেশি এক্সপেরিয়েন্স বাড়বে এর সঠিক অউটপুট দেয়ার হার তত বাড়বে।",
      "image": "assets/blog_image/aiki.jpg",
    },
    {
      "title": "মেশিন লার্নিং কি? এটার কাজ কি?",
      "dis":
          "মেশিন লার্নিং হচ্ছে Artificial Intelligence (AI) এর একটি শাখা মাত্র। মেশিন লার্নিং হচ্ছে Artificial Intelligence বা কৃত্রিম বুদ্ধিমত্তার একটি অ্যাপলিকেশন যা সিস্টেম কে স্পষ্টভাবে প্রোগ্রাম না করে অটোমেটিকেলি অভিজ্ঞতা থেকে শেখার এবং উন্নত করার ক্ষমতা প্রদান করে।অর্থাৎ বলা যায়, মেশিন লার্নিং হচ্ছে একটি প্রোগ্রাম যে কিনা নিজেই নিজেকে Train up করতে পারবে, এবং কোনো প্রোগ্রাম এর উপরে কাজ করে আউটপুট কী হবে সেইটা প্রেডিক্ট করতে পারবে।",
      "image": "assets/blog_image/machine.jpg",
    },
    {
      "title": "আইটি বিষয়ে সবচেয়ে কোন সেক্টরে ভবিষ্যতে চাহিদা থাকবে?",
      "dis":
          "আইটি শাখার মুখ্য চাহিদা বৃদ্ধি করবে মেশিন লার্নিং, অ্যার্টিফিশিয়াল ইন্টেলিজেন্স, হাইব্রিড ক্লাউড, ডিজিটাল সেবা, ইওটিয়, বিগ ডেটা এবং সাইবার ​​নিরাপত্তা সেক্টরে। এই সেক্টরগুলি এখন থেকে ভবিষ্যতে খুব গুরুত্বপূর্ণ হবে কারণ সম্প্রসারণ, উন্নত দেশের ভবিষ্যতে ডিজিটাল পরিবর্তন ও সাইবার ​​নিরাপত্তা সর্বাধিক গুরুত্বপূর্ণ হবে।েশিন লার্নিং এবং অ্যার্টিফিশিয়াল ইন্টেলিজেন্স (AI) সেক্টরে বৃদ্ধি পাওয়া হবে কারণ এগুলি সাধারণভাবে প্রদত্ত বিগ ডেটা ব্যবহার করে সাহায্য করে প্রোসেসিং, নেটওয়ার্কিং এবং ডিজিটাল আউটপুট উন্নত করতে। হাইব্রিড ক্লাউড সেবা ব্যবহারকারীদের মধ্যে অভ্যন্তরীণ এবং পাবলিক সার্ভারের মধ্যে সমন্বয় সরবরাহ করবে, এটি ব্যবহারকারীদের জন্য একটি সুবিধাসম্পন্ন পরিবেশ সৃষ্টি করবে এবং উন্নত অনুভব উন্নত করবে।ডিজিটাল সেবার চাহিদা বাঢ়বে কারণ মানুষের জীবনে ডিজিটালাইজেশন হয়েছে, এবং অনলাইন সেবা প্রদানকারী সংস্থাগুলি চাহিদা অনুযায়ী উন্নয়ন করতে যাদের ডিজিটাল প্রদানে হয়।ইওটি প্রযুক্তির চাহিদা বাড়বে কারণ নেটওয়ার্ক ডিভাইস সংখ্যার বৃদ্ধি, আপাতত সম্প্রসারণ বা সংযোগের জন্য ডিজাইন করা ক্ষমতায় বহু ডিভাইসের মধ্যে তার ব্যবহার সম্পর্কিত সাধারণ মৌলিক অভিযন্ত্রণ তৈরী করতে।বিগ ডেটা সেক্টরে চাহিদা বৃদ্ধি পাবে কারণ বহু সময় অতিরিক্ত ডেটা, থকা হাস্টে প্রাসাদিত করা নেটওয়ার্কের মূল্যায়ন করা হয়। তাই, ডেটা ভিত্তিক সেবা সরবরাহকারীরা আপনাদের প্রদানকৃত সেবাগুলির মাধ্যমে ডেটা ভিত্তিক সাহায্য প্রদান করে।সাইবার ​​নিরাপত্তা সেক্টরে আরও বৃদ্ধি পাওয়া যাবে কারণ সাইবার ​​হ্যাকিং, ডেটা লুকানো এবং মালিকানাধীন ডেটা লুকিং এর মাধ্যমে জন্য এটি কোনও উদ্দেশ্যবিহীন কোম্পাউনেন্টের ধরনগুলি থাকতে পারে। উন্নত প্রযুক্তিতে বেশ কিছু ক্ষেত্রে অনুমান করা যায়।এই সেক্টরগুলি মানুষের জীবনের প্রতি দিক পরিবর্তন আনবে এবং ভবিষ্যতে সামগ্রিক উন্নতি করবে। সবার সাথে এই সেক্টর ও উন্নত করার ও নতুন প্রযুক্তি পরিচয় করার জন্য প্রয়োজন হতে পারে।",
      "image": "assets/blog_image/it.jpg",
    },
  ];
}
/*
*     {
      "title":
          "",
      "dis":"",
      "image":
          "",
    },
    * */
